app/controllers/songs_controller.rb

  def new
    if params[:artist_id]
        @song = Song.new(artist: Artist.find_by(id: params[:artist_id]))
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @song = Song.find_by(id: params[:id])
    @artist = Artist.find_by(id: params[:artist_id])
    if params[:artist_id] && !Artist.exists?(params[:artist_id])
      flash[:alert] = "No such artist."
      redirect_to artists_path
    elsif params[:artist_id] && !Artist.find_by(params[:artist_id]).songs.include?(@song)
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1234]]
SELECT  "artists".* FROM "artists" WHERE (1234) LIMIT 1
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1234]]
SELECT  1 AS one FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1234]]
SELECT  1 AS one FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1]]